# Practical Exam: Hotel Operations

LuxurStay Hotels is a major, international chain of hotels. They offer hotels for both business and leisure travellers in major cities across the world. The chain prides themselves on the level of customer service that they offer. 

However, the management has been receiving complaints about slow room service in some hotel branches. As these complaints are impacting the customer satisfaction rates, it has become a serious issue. Recent data shows that customer satisfaction has dropped from the 4.5 rating that they expect. 

You are working with the Head of Operations to identify possible causes and hotel branches with the worst problems. 

## Data

The following schema diagram shows the tables available. You have only been provided with data where customers provided a feedback rating.

![hotel_operations](hotel_operations.png)

# Task 1

Before you can start any analysis, you need to confirm that the data is accurate and reflects what you expect to see. 

It is known that there are some issues with the `branch` table, and the data team have provided the following data description. 

Write a query to return data matching this description, including identifying and cleaning all invalid values. You must match all column names and description criteria. Your output should be a DataFrame named 'clean_branch_data'.

| Column Name | Criteria                                                |
|-------------|---------------------------------------------------------|
|id | Nominal. The unique identifier of the hotel. </br>Missing values are not possible due to the database structure.|
| location | Nominal. The location of the particular hotel. One of four possible values, 'EMEA', 'NA', 'LATAM' and 'APAC'. </br>Missing values should be replaced with “Unknown”. |
| total_rooms | Discrete. The total number of rooms in the hotel. Must be a positive integer between 1 and 400. </br>Missing values should be replaced with the default number of rooms, 100. |
| staff_count | Discrete. The number of staff employeed in the hotel service department. </br>Missing values should be replaced with the total_rooms multiplied by 1.5. |
| opening_date | Discrete. The year in which the hotel opened. This can be any value between 2000 and 2023. </br>Missing values should be replaced with 2023. |
| target_guests | Nominal. The primary type of guest that is expected to use the hotel. Can be one of 'Leisure' or 'Business'. </br>Missing values should be replaced with 'Leisure'. |

In [1]:
SELECT
    id,
    COALESCE(location, 'Unknown') AS location,
    CASE
        WHEN total_rooms BETWEEN 1 AND 400 THEN total_rooms
        ELSE 100
    END AS total_rooms,
    CASE
        WHEN staff_count IS NOT NULL THEN staff_count
        ELSE total_rooms * 1.5
    END AS staff_count,
    CASE
        WHEN opening_date = '-' THEN '2023'
        WHEN opening_date BETWEEN '2000' AND '2023' THEN opening_date
        ELSE '2023'
    END AS opening_date,
    CASE
        WHEN target_guests IS NULL THEN 'Leisure'
        WHEN LOWER(target_guests) LIKE 'b%' THEN 'Business'
        ELSE target_guests END AS target_guests
FROM
    public.branch;

     id location  total_rooms  staff_count  opening_date target_guests
0     1    LATAM          168          178          2017      Business
1     2     APAC          154           82          2010       Leisure
2     3     APAC          212          467          2003       Leisure
3     4     APAC          230          387          2023      Business
4     5     APAC          292          293          2002      Business
..  ...      ...          ...          ...           ...           ...
95   96     APAC          237          257          2000      Business
96   97     APAC          107          169          2005      Business
97   98     EMEA          196          126          2002       Leisure
98   99     APAC          242          251          2021      Business
99  100    LATAM          349          612          2020      Business

[100 rows x 6 columns]

# Task 2

The Head of Operations wants to know whether there is a difference in time taken to respond to a customer request in each hotel. They already know that different services take different lengths of time. 

Calculate the average and maximum duration for each branch and service. 
- Your output should be a DataFrame named 'average_time_service'
- It should include the columns `service_id`, `branch_id`, `avg_time_taken` and `max_time_taken`
- Values should be rounded to two decimal places where appropriate.

In [2]:
SELECT
    id,
    -- Clean location values, replace missing with 'Unknown'
    COALESCE(TRIM(location), 'Unknown') AS location,

    -- Ensure total_rooms is a positive integer between 1 and 400, replace invalid/missing with 100
    COALESCE(
        CASE
            WHEN total_rooms::int BETWEEN 1 AND 400 THEN total_rooms::int
            ELSE NULL
        END, 100) AS total_rooms,

    -- Ensure staff_count is valid, otherwise replace with total_rooms * 1.5
    COALESCE(staff_count::int, total_rooms::int * 1.5) AS staff_count,

    -- Clean and cast opening_date, ensuring it's between 2000 and 2023, replace invalid/missing with 2023
    COALESCE(
        CASE
            WHEN opening_date ~ '^[0-9]+$' AND opening_date::int BETWEEN 2000 AND 2023 THEN opening_date::int
            ELSE NULL
        END, 2023) AS opening_date,

    -- Clean target_guests, replace missing values with 'Leisure'
    COALESCE(
        CASE
            WHEN LOWER(target_guests) IN ('leisure', 'business') THEN target_guests
            ELSE NULL
        END, 'Leisure') AS target_guests

FROM
    Branch;

     id location  total_rooms  staff_count  opening_date target_guests
0     1    LATAM          168          178          2017      Business
1     2     APAC          154           82          2010       Leisure
2     3     APAC          212          467          2003       Leisure
3     4     APAC          230          387          2023      Business
4     5     APAC          292          293          2002      Business
..  ...      ...          ...          ...           ...           ...
95   96     APAC          237          257          2000      Business
96   97     APAC          107          169          2005      Business
97   98     EMEA          196          126          2002       Leisure
98   99     APAC          242          251          2021      Business
99  100    LATAM          349          612          2020      Business

[100 rows x 6 columns]

# Task 3

The management team want to target improvements in `Meal` and `Laundry` service in Europe (`EMEA`) and Latin America (`LATAM`). 

Write a query to return the `description` of the service, the `id` and `location` of the branch, the id of the request as `request_id` and the `rating` for the services and locations of interest to the management team. 

Your output should be a DataFrame named 'target_hotels'.

Use the original branch table, not the output of task 1.

In [ ]:
-- Write your query for task 3 in this cell

# Task 4

So that you can take a more detailed look at the lowest performing hotels, you want to get service and branch information where the average rating for the branch and service combination is lower than 4.5 - the target set by management.  

- Your output should be a DataFrame named 'average_rating'
- It should return the `service_id` and `branch_id`, and the average rating (`avg_rating`)
- Values should be rounded to 2 decimal places where appropriate.

In [ ]:
-- Write your query for task 4 in this cell